In [71]:
!pip install ipython-sql --quiet

In [3]:
%reload_ext sql

In [5]:
from getpass import getpass
password = getpass()

 ········

In [7]:
conn_str = "mysql+pymysql://root:{}@localhost:3306/EmployeeSalary".format(password)

In [9]:
%sql {conn_str}

In [11]:
%sql SHOW tables;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
3 rows affected.

[('employees managers',), ('employees salary',), ('employees status',)]

In [99]:
%%sql 
/* 1 Select 15 managers that stays in Texas? */;

SELECT Manager FROM employeesalary.`employees managers` 
WHERE STATE REGEXP 'TX' LIMIT 15;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
0 rows affected.
15 rows affected.

[('Inocencia Wiste',),
 ('Jerrell Baltazar',),
 ('Dierdre Ivey',),
 ('Amanda Bemis',),
 ('Kimberley Proctor',),
 ('Contessa Courser',),
 ('Patrica Mcvay',),
 ('Leila Lashley',),
 ('Gricelda Lassen',),
 ('Claretha Ahern',),
 ('Roselia Sandoz',),
 ('Jerry berry',),
 ('Inocencia Wiste',),
 ('Jerrell Baltazar',),
 ('Dierdre Ivey',)]

In [15]:
%%sql
/* 2 How many managers are there in each state? */;

SELECT STATE, COUNT(*) AS 'numberOfEmployees' FROM employeesalary.`employees managers`
GROUP BY STATE;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
0 rows affected.
6 rows affected.

[('WA', 207), ('FL', 96), ('CA', 55), ('TX', 164), ('IL', 164), ('OH', 55)]

In [107]:
%%sql
/* 3 How many managers whose name starts with M? */

SELECT COUNT(Manager) FROM employeesalary.`employees managers`
WHERE Manager LIKE 'M%'

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[(102,)]

In [111]:
%%sql
/* 4 Who are the 20 managers that are working fulltime? */

SELECT Manager, Status FROM employeesalary.`employees managers`
JOIN employeesalary.`employees status` ON `employees managers`.`Employee ID` = `employees status`.`Employee ID`
WHERE Status REGEXP 'Full Time' LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
20 rows affected.

[('Rebbecca Tyree', 'Full Time'),
 ('Kate Dagenhart', 'Full Time'),
 ('Inocencia Wiste', 'Full Time'),
 ('Jerrell Baltazar', 'Full Time'),
 ('Angelina Brakefield', 'Full Time'),
 ('Jeanetta Steenbergen', 'Full Time'),
 ('Dierdre Ivey', 'Full Time'),
 ('Jeffry Warthen', 'Full Time'),
 ('Frankie Haberman', 'Full Time'),
 ('Brigid Mattos', 'Full Time'),
 ('Angel Turnbull', 'Full Time'),
 ('Leona Selander', 'Full Time'),
 ('Wynell Griffeth', 'Full Time'),
 ('Meggan Seamon', 'Full Time'),
 ('Amanda Bemis', 'Full Time'),
 ('Concha Hisle', 'Full Time'),
 ('Marilynn Oxford', 'Full Time'),
 ('Zonia Mcknight', 'Full Time'),
 ('Breana Fravel', 'Full Time'),
 ('Kimberley Proctor', 'Full Time')]

In [149]:
%%sql
/* 5 Who are the 20 managers that started working either in 2010 or 2015? */

SELECT Manager, `Client Since` FROM employeesalary.`employees status`
JOIN employeesalary.`employees managers` ON `employees status`.`Employee ID` = `employees managers`.`Employee ID`
WHERE YEAR(`Client Since`) = 2014 OR YEAR(`Client Since`) = 2015 LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
20 rows affected.

[('Sherron Gaumer', '2014-08-18'),
 ('Graham Sparling', '2015-02-18'),
 ('Johnson Epting', '2015-02-26'),
 ('Breana Fravel', '2015-05-06'),
 ('Contessa Courser', '2015-10-15'),
 ('Dillon Lumpkins', '2014-05-23'),
 ('Leila Lashley', '2015-07-14'),
 ('Margorie Cassidy', '2014-07-29'),
 ('Claretha Ahern', '2014-08-19'),
 ('Carli Leleux', '2015-09-10'),
 ('Paul Young', '2014-10-15'),
 ('Sherron Gaumer', '2014-08-19'),
 ('Kate Dagenhart', '2015-11-17'),
 ('Johnson Epting', '2015-12-27'),
 ('Frankie Haberman', '2014-01-03'),
 ('Brigid Mattos', '2015-02-16'),
 ('Concha Hisle', '2015-04-12'),
 ('Patrica Mcvay', '2014-05-16'),
 ('Leila Lashley', '2015-05-30'),
 ('Starla Waite', '2014-05-20')]

In [41]:
%%sql
/* 6 What is the minimum salary for fulltime employees? */

SELECT MIN(replace(Salary, '$', ' ')) AS maximumSalary FROM employeesalary.`employees salary`
JOIN employeesalary.`employees status` ON `employees salary`.`Employee ID` = `employees salary`.`Employee ID`
WHERE Status REGEXP 'Full Time';

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[('10 280',)]

In [153]:
%%sql
/* 7 What is the second miximum salary? */
    
SELECT MAX(Salary) AS 'secondMaxSalary' FROM employeesalary.`employees salary`
WHERE Salary < (SELECT MAX(Salary) FROM employeesalary.`employees salary`);

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[('99 950',)]

In [153]:
%%sql
/* 8 Who are the 20 managers that are earning more than 50 000? */

UPDATE employeesalary.`employees salary` SET  
Salary = REPLACE(Salary,'$', '') WHERE Salary LIKE '$%';

SELECT Manager AS 'managers', Salary AS 'salaries' FROM employeesalary.`employees managers` 
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID` 
WHERE Salary > '50000' ORDER BY Salary DESC LIMIT 20;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
0 rows affected.
20 rows affected.

[('Peggy Portner', '99 960'),
 ('Carli Leleux', '99 950'),
 ('Angelina Brakefield', '99 908'),
 ('Mari Acy', '99 876'),
 ('Meggan Seamon', '99 708'),
 ('Yuriko Du', '99 635'),
 ('Brigid Mattos', '99 614'),
 ('Yuriko Du', '99 561'),
 ('Zonia Mcknight', '99 446'),
 ('Jeffry Warthen', '99 383'),
 ('Jeanetta Steenbergen', '99 309'),
 ('Carl Lewis', '99 257'),
 ('Concha Hisle', '99 246'),
 ('Rebbecca Tyree', '99 194'),
 ('Kimberley Proctor', '98 774'),
 ('Marty Buettner', '98 732'),
 ('Brigid Mattos', '98 522'),
 ('Brigid Mattos', '98 333'),
 ('Santo Yocom', '97 367'),
 ('Angelina Brakefield', '97 251')]

In [59]:
%%sql
/* 9 How many managers that are earning less than 50000? */

SELECT COUNT(Manager) FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
WHERE Salary < '50000';

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[(312,)]

In [61]:
%%sql
/* 10 What is the average salary from each state? */

SELECT STATE, ROUND(avg(Salary), 2) AS 'avgSalary' FROM employeesalary.`employees salary`
JOIN employeesalary.`employees managers` ON `employees salary`.`Employee ID` = `employees managers`.`Employee ID`
GROUP BY STATE;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
6 rows affected.

[('WA', 59.96),
 ('FL', 54.89),
 ('CA', 60.8),
 ('TX', 57.52),
 ('IL', 59.35),
 ('OH', 57.69)]

In [63]:
%%sql
/* 11 Who is the employee that earns the lowest salary? */
    
SELECT Manager AS 'Manager', Salary AS minSalary FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
ORDER BY Salary ASC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[('Frankie Haberman', '10 280')]

In [65]:
%%sql
/* 12 What is the median salary of all the employees? */

SELECT MAX(Salary) AS "Median" 
FROM (SELECT Salary, 
NTILE(4) OVER(ORDER BY Salary) AS Quartile
 FROM employeesalary.`employees salary` 
) employeesalary
WHERE Quartile = 2;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[('54 800',)]

In [67]:
%%sql 
/* 13 Mention all the States and their highest paid managers and their salary. */
    
SELECT STATE, Manager, max(Salary) AS 'salaries' FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
GROUP BY STATE, Manager;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
59 rows affected.

[('WA', 'Rebbecca Tyree', '99 194'),
 ('WA', 'Sherron Gaumer', '81 732'),
 ('WA', 'Oralee Hilliker', '93 251'),
 ('FL', 'Vita Tores', '91 707'),
 ('CA', 'Kate Dagenhart', '93 198'),
 ('TX', 'Inocencia Wiste', '95 288'),
 ('FL', 'Kassie Pertuit', '93 419'),
 ('IL', 'Winfred Yoon', '95 172'),
 ('TX', 'Jerrell Baltazar', '92 547'),
 ('FL', 'Angelina Brakefield', '99 908'),
 ('IL', 'Yuriko Du', '99 635'),
 ('IL', 'Jeanetta Steenbergen', '99 309'),
 ('IL', 'Graham Sparling', '92 505'),
 ('TX', 'Dierdre Ivey', '95 141'),
 ('CA', 'Jeffry Warthen', '99 383'),
 ('OH', 'Johnson Epting', '90 920'),
 ('WA', 'Tish Seidman', '95 592'),
 ('WA', 'Frankie Haberman', '67 326'),
 ('OH', 'Brigid Mattos', '99 614'),
 ('WA', 'Timothy Kring', '75 915'),
 ('FL', 'Angel Turnbull', '83 265'),
 ('CA', 'Leona Selander', '87 812'),
 ('IL', 'Wynell Griffeth', '97 220'),
 ('WA', 'Meggan Seamon', '99 708'),
 ('TX', 'Amanda Bemis', '91 686'),
 ('FL', 'Concha Hisle', '99 246'),
 ('WA', 'Marilynn Oxford', '93 576'),
 ('WA', 'Isaiah Rines', '90 773'),
 ('IL', 'Mari Acy', '99 876'),
 ('WA', 'Zonia Mcknight', '99 446'),
 ('WA', 'Breana Fravel', '88 841'),
 ('TX', 'Kimberley Proctor', '98 774'),
 ('TX', 'Contessa Courser', '95 277'),
 ('OH', 'Dillon Lumpkins', '96 695'),
 ('TX', 'Patrica Mcvay', '89 891'),
 ('IL', 'Peggy Portner', '99 960'),
 ('TX', 'Leila Lashley', '94 301'),
 ('WA', 'Mohamed Fluellen', '95 897'),
 ('IL', 'Laci Rhynes', '89 345'),
 ('CA', 'Rebecka Kim', '82 352'),
 ('OH', 'Francesco Roquemore', '94 175'),
 ('TX', 'Gricelda Lassen', '92 138'),
 ('IL', 'Maxie Chauez', '94 017'),
 ('IL', 'Marty Buettner', '98 732'),
 ('FL', 'Margorie Cassidy', '86 300'),
 ('TX', 'Claretha Ahern', '92 705'),
 ('FL', 'Carli Leleux', '99 950'),
 ('IL', 'Santo Yocom', '97 367'),
 ('WA', 'Starla Waite', '84 399'),
 ('TX', 'Roselia Sandoz', '86 016'),
 ('WA', 'Paul Young', '87 528'),
 ('WA', 'Carl Lewis', '99 257'),
 ('IL', 'Mike Tyson', '90 290'),
 ('TX', 'Jerry berry', '94 689'),
 ('IL', '', '62 601'),
 ('OH', '', '68 303'),
 ('WA', '', '91 959'),
 ('TX', '', '91 686'),
 ('FL', '', '72 839')]

In [69]:
%%sql
/* 14 How many salaries that are duplicated? */
    
SELECT Salary, COUNT(Salary) AS duplicatedSalary FROM employeesalary.`employees salary` 
GROUP BY Salary 
HAVING COUNT(Salary) > 1;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
32 rows affected.

[('12 285', 2),
 ('57 015', 2),
 ('53 393', 2),
 ('55 923', 2),
 ('36 866', 2),
 ('27 216', 2),
 ('70 844', 3),
 ('74 466', 2),
 ('70 634', 3),
 ('54 695', 2),
 ('30 450', 2),
 ('29 022', 2),
 ('45 833', 2),
 ('61 152', 2),
 ('25 032', 2),
 ('40 961', 3),
 ('72 513', 2),
 ('30 251', 2),
 ('73 752', 2),
 ('88 841', 2),
 ('76 251', 2),
 ('54 684', 2),
 ('47 292', 2),
 ('57 215', 2),
 ('62 223', 2),
 ('36 110', 2),
 ('62 591', 2),
 ('72 408', 2),
 ('69 384', 2),
 ('91 686', 2),
 ('45 045', 2),
 ('90 920', 2)]

In [77]:
%%sql
/* 15 How many employees that did not receive their bonuses? */

SELECT COUNT(Manager) FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
WHERE Bonus IS NULL;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[(0,)]

In [157]:
%%sql
/* 16 Who are 15 employees whose bonuses are between 10% to 50%? */

SELECT manager FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
WHERE bonus BETWEEN 12 AND 20 LIMIT 15;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
15 rows affected.

[('Jerrell Baltazar',),
 ('Dierdre Ivey',),
 ('Jeffry Warthen',),
 ('Tish Seidman',),
 ('Brigid Mattos',),
 ('Mohamed Fluellen',),
 ('Laci Rhynes',),
 ('Marty Buettner',),
 ('Margorie Cassidy',),
 ('Santo Yocom',),
 ('Rebbecca Tyree',),
 ('Inocencia Wiste',),
 ('Winfred Yoon',),
 ('Jerrell Baltazar',),
 ('Angelina Brakefield',)]

In [81]:
%%sql
/* 17 Who is the manager that gets the highest bonus? */

SELECT Manager FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
ORDER BY bonus DESC LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[('Wynell Griffeth',)]

In [83]:
%%sql
/* 18  Mention 5 contract employees who have the highest bonuses. */

SELECT manager, status FROM employeesalary.`employees managers`
JOIN employeesalary.`employees salary` ON `employees managers`.`Employee ID` = `employees salary`.`Employee ID`
JOIN employeesalary.`employees status` ON `employees salary`.`Employee ID` = `employees status`.`Employee ID` 
WHERE status = 'contract' 
ORDER BY bonus DESC LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
5 rows affected.

[('Maxie Chauez', 'Contract'),
 ('Frankie Haberman', 'Contract'),
 ('Peggy Portner', 'Contract'),
 ('Patrica Mcvay', 'Contract'),
 ('Oralee Hilliker', 'Contract')]

In [43]:
%%sql
/* 19 How many bonuses that are unique? */

SELECT COUNT(DISTINCT Bonus) AS uniqueBonuses FROM employeesalary.`employees salary`

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[(9,)]

In [159]:
%%sql
/* 20 Show the 15 projects that have been done in Washington State. */

SELECT Projects AS 'projects', STATE AS 'state' FROM employeesalary.`employees salary`
JOIN employeesalary.`employees managers` ON `employees salary`.`Employee ID` = `employees managers`.`Employee ID`
WHERE STATE = 'WA' LIMIT 15;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
15 rows affected.

[(15, 'WA'),
 (2, 'WA'),
 (6, 'WA'),
 (13, 'WA'),
 (5, 'WA'),
 (4, 'WA'),
 (13, 'WA'),
 (13, 'WA'),
 (7, 'WA'),
 (4, 'WA'),
 (2, 'WA'),
 (7, 'WA'),
 (2, 'WA'),
 (7, 'WA'),
 (2, 'WA')]

In [115]:
%%sql
/* 21 How many halftime versus fulltime employees are there? */

SELECT COUNT(Status) FROM employeesalary.`employees status`
WHERE Status = 'Full Time' & 'Half-Time';

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
1 rows affected.

[(741,)]

In [89]:
%%sql
/* 22 How many employees are there in status category? */
    
SELECT Status, COUNT(status) AS employeeNumber FROM employeesalary.`employees status`
GROUP BY status;

 * mysql+pymysql://root:***@localhost:3306/EmployeeSalary
5 rows affected.

[('Full Time', 358),
 ('Half-Time', 87),
 ('Contract', 186),
 ('Hourly', 47),
 ('', 63)]